In [1]:
%matplotlib inline

import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
mydata=np.random.randn(4,3)  #randn 平均值是0, 標準差是1的亂數

In [4]:
mydata

array([[ 1.92378938, -0.10107356, -1.87101326],
       [ 0.53842367,  0.88610151, -1.35913714],
       [-0.17459203, -0.0465283 ,  0.38081118],
       [ 1.4724516 , -0.11573302, -0.0978688 ]])

In [5]:
list("ABCD")

['A', 'B', 'C', 'D']

In [6]:
list("甲乙丙丁")

['甲', '乙', '丙', '丁']

In [7]:
pd.DataFrame?

In [8]:
df1=pd.DataFrame(mydata, columns=list("ABC"))

In [9]:
df1

          A         B         C
0  1.923789 -0.101074 -1.871013
1  0.538424  0.886102 -1.359137
2 -0.174592 -0.046528  0.380811
3  1.472452 -0.115733 -0.097869

In [10]:
df2=pd.DataFrame(np.random.randn(3,3),columns=list("ABC"))

In [11]:
df2

          A         B         C
0 -0.739004 -0.420473  0.946682
1 -0.447121 -0.722117  1.061374
2 -0.172913 -0.447106 -0.517997

In [12]:
df3=pd.concat([df1,df2],axis=0) #合併2個 DataFrame, axis=0時,是上下(列), axis=1是左右(行)

In [13]:
df3

          A         B         C
0  1.923789 -0.101074 -1.871013
1  0.538424  0.886102 -1.359137
2 -0.174592 -0.046528  0.380811
3  1.472452 -0.115733 -0.097869
0 -0.739004 -0.420473  0.946682
1 -0.447121 -0.722117  1.061374
2 -0.172913 -0.447106 -0.517997

In [16]:
df3.index=range(7)  #修改 index

In [17]:
df3

          A         B         C
0  1.923789 -0.101074 -1.871013
1  0.538424  0.886102 -1.359137
2 -0.174592 -0.046528  0.380811
3  1.472452 -0.115733 -0.097869
4 -0.739004 -0.420473  0.946682
5 -0.447121 -0.722117  1.061374
6 -0.172913 -0.447106 -0.517997

In [18]:
df4=pd.concat([df1,df2],axis=1) #合併2個 DataFrame, 左右(行)

In [19]:
df4

          A         B         C         A         B         C
0  1.923789 -0.101074 -1.871013 -0.739004 -0.420473  0.946682
1  0.538424  0.886102 -1.359137 -0.447121 -0.722117  1.061374
2 -0.174592 -0.046528  0.380811 -0.172913 -0.447106 -0.517997
3  1.472452 -0.115733 -0.097869       NaN       NaN       NaN

In [21]:
pd.concat?

In [25]:
df4

          A         B         C         A         B         C
0  1.923789 -0.101074 -1.871013 -0.739004 -0.420473  0.946682
1  0.538424  0.886102 -1.359137 -0.447121 -0.722117  1.061374
2 -0.174592 -0.046528  0.380811 -0.172913 -0.447106 -0.517997
3  1.472452 -0.115733 -0.097869       NaN       NaN       NaN

In [29]:
df4.columns=list("123456") #修改欄位名稱

In [30]:
df4

          1         2         3         4         5         6
0  1.923789 -0.101074 -1.871013 -0.739004 -0.420473  0.946682
1  0.538424  0.886102 -1.359137 -0.447121 -0.722117  1.061374
2 -0.174592 -0.046528  0.380811 -0.172913 -0.447106 -0.517997
3  1.472452 -0.115733 -0.097869       NaN       NaN       NaN